```
krishna@turbotindias-MacBook-Pro azure_check_cost_controls % terraform apply --var-file=demo.tfvars
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.azure_disk_active will be created
  + resource "turbot_policy_setting" "azure_disk_active" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/diskActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_disk_active_attached will be created
  + resource "turbot_policy_setting" "azure_disk_active_attached" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/diskActiveAttached"
      + value                        = "Force inactive if unattached"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.azure_storage_access_tier will be created
  + resource "turbot_policy_setting" "azure_storage_access_tier" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-storage#/policy/types/storageAccountAccessTier"
      + value                        = "Check: Cool"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-aks-managedCluster"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-aks#/policy/types/managedClusterActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-compute-image"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/imageActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-compute-snapshot"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/snapshotActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-compute-virtualMachine"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/virtualMachineActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-cosmosdb-databaseAccount"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-cosmosdb#/policy/types/databaseAccountActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-cosmosdb-mongoDbDatabase"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-cosmosdb#/policy/types/mongoDbDatabaseActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-cosmosdb-sqlContainer"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-cosmosdb#/policy/types/sqlContainerActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-cosmosdb-sqlDatabase"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-cosmosdb#/policy/types/sqlDatabaseActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-databricks-databricksWorkspace"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-databricks#/policy/types/databricksWorkspaceActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-mysql-server"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-mysql#/policy/types/serverActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-postgresql-database"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/databaseActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-postgresql-server"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/serverActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-sql-database"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/databaseActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-sql-server"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/serverActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-storage-container"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-storage#/policy/types/containerActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-storage-fileShare"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-storage#/policy/types/fileShareActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-storage-storageAccount"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-storage#/policy/types/storageAccountActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_active_policies["azure-synapseanalytics-synapseWorkspace"] will be created
  + resource "turbot_policy_setting" "set_resource_active_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-synapseanalytics#/policy/types/synapseWorkspaceActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-aks-managedCluster"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-aks#/policy/types/managedClusterActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-compute-image"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/imageActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-compute-snapshot"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/snapshotActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-compute-virtualMachine"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/virtualMachineActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-cosmosdb-databaseAccount"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-cosmosdb#/policy/types/databaseAccountActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-cosmosdb-mongoDbDatabase"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-cosmosdb#/policy/types/mongoDbDatabaseActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-cosmosdb-sqlContainer"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-cosmosdb#/policy/types/sqlContainerActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-cosmosdb-sqlDatabase"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-cosmosdb#/policy/types/sqlDatabaseActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-databricks-databricksWorkspace"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-databricks#/policy/types/databricksWorkspaceActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-mysql-server"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-mysql#/policy/types/serverActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-postgresql-database"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/databaseActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-postgresql-server"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/serverActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-sql-database"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/databaseActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-sql-server"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/serverActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-storage-container"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-storage#/policy/types/containerActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-storage-fileShare"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-storage#/policy/types/fileShareActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-storage-storageAccount"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-storage#/policy/types/storageAccountActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_age_policies["azure-synapseanalytics-synapseWorkspace"] will be created
  + resource "turbot_policy_setting" "set_resource_age_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-synapseanalytics#/policy/types/synapseWorkspaceActiveAge"
      + value                        = "Force inactive if age > 60 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.vm_instance_schedule will be created
  + resource "turbot_policy_setting" "vm_instance_schedule" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/virtualMachineSchedule"
      + value                        = "Skip"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.azure_cost_controls will be created
  + resource "turbot_smart_folder" "azure_cost_controls" {
      + description = "Defines sets of policies for Azure check regions baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "Azure Check Cost Control Policies"
    }

Plan: 41 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.azure_cost_controls: Creating...
turbot_smart_folder.azure_cost_controls: Creation complete after 1s [id=216087240742295]
turbot_policy_setting.set_resource_age_policies["azure-compute-image"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-sql-database"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-compute-snapshot"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-storage-storageAccount"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-storage-fileShare"]: Creating...
turbot_policy_setting.azure_disk_active: Creating...
turbot_policy_setting.set_resource_age_policies["azure-mysql-server"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-cosmosdb-sqlContainer"]: Creating...
turbot_policy_setting.azure_storage_access_tier: Creating...
turbot_policy_setting.set_resource_age_policies["azure-sql-server"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-mysql-server"]: Creation complete after 3s [id=216087243508125]
turbot_policy_setting.set_resource_active_policies["azure-compute-snapshot"]: Creation complete after 3s [id=216087243509150]
turbot_policy_setting.set_resource_active_policies["azure-postgresql-server"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-storage-fileShare"]: Creating...
turbot_policy_setting.azure_storage_access_tier: Creation complete after 4s [id=216087244357049]
turbot_policy_setting.azure_disk_active: Creation complete after 4s [id=216087244455366]
turbot_policy_setting.set_resource_active_policies["azure-sql-database"]: Creation complete after 4s [id=216087243716010]
turbot_policy_setting.set_resource_age_policies["azure-compute-image"]: Creation complete after 4s [id=216087244455365]
turbot_policy_setting.set_resource_age_policies["azure-sql-server"]: Creation complete after 4s [id=216087244360124]
turbot_policy_setting.set_resource_age_policies["azure-cosmosdb-sqlDatabase"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-storage-storageAccount"]: Creation complete after 4s [id=216087243714984]
turbot_policy_setting.set_resource_active_policies["azure-storage-fileShare"]: Creation complete after 4s [id=216087243716009]
turbot_policy_setting.set_resource_active_policies["azure-databricks-databricksWorkspace"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-storage-storageAccount"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-cosmosdb-sqlContainer"]: Creation complete after 4s [id=216087244361149]
turbot_policy_setting.set_resource_active_policies["azure-synapseanalytics-synapseWorkspace"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-compute-snapshot"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-postgresql-database"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-storage-container"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-cosmosdb-databaseAccount"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-storage-fileShare"]: Creation complete after 3s [id=216087246415311]
turbot_policy_setting.set_resource_active_policies["azure-postgresql-server"]: Creation complete after 3s [id=216087246549459]
turbot_policy_setting.set_resource_active_policies["azure-compute-virtualMachine"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-cosmosdb-mongoDbDatabase"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-synapseanalytics-synapseWorkspace"]: Creation complete after 3s [id=216087247442415]
turbot_policy_setting.set_resource_active_policies["azure-storage-container"]: Creation complete after 3s [id=216087247362524]
turbot_policy_setting.set_resource_active_policies["azure-databricks-databricksWorkspace"]: Creation complete after 3s [id=216087247368674]
turbot_policy_setting.set_resource_age_policies["azure-postgresql-database"]: Creation complete after 3s [id=216087247451640]
turbot_policy_setting.set_resource_age_policies["azure-compute-snapshot"]: Creation complete after 3s [id=216087247365599]
turbot_policy_setting.vm_instance_schedule: Creating...
turbot_policy_setting.set_resource_age_policies["azure-cosmosdb-sqlDatabase"]: Creation complete after 3s [id=216087247446514]
turbot_policy_setting.set_resource_active_policies["azure-storage-storageAccount"]: Creation complete after 3s [id=216087247447539]
turbot_policy_setting.azure_disk_active_attached: Creating...
turbot_policy_setting.set_resource_active_policies["azure-mysql-server"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-cosmosdb-databaseAccount"]: Creation complete after 3s [id=216087247370725]
turbot_policy_setting.set_resource_active_policies["azure-sql-server"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-postgresql-database"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-aks-managedCluster"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-cosmosdb-databaseAccount"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-compute-image"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-cosmosdb-mongoDbDatabase"]: Creation complete after 2s [id=216087248896516]
turbot_policy_setting.set_resource_active_policies["azure-compute-virtualMachine"]: Creation complete after 2s [id=216087248891393]
turbot_policy_setting.set_resource_age_policies["azure-compute-virtualMachine"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-synapseanalytics-synapseWorkspace"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-postgresql-database"]: Creation complete after 2s [id=216087250321934]
turbot_policy_setting.vm_instance_schedule: Creation complete after 2s [id=216087250327057]
turbot_policy_setting.set_resource_active_policies["azure-compute-image"]: Creation complete after 2s [id=216087250390567]
turbot_policy_setting.azure_disk_active_attached: Creation complete after 2s [id=216087250384417]
turbot_policy_setting.set_resource_active_policies["azure-sql-server"]: Creation complete after 2s [id=216087250328082]
turbot_policy_setting.set_resource_active_policies["azure-aks-managedCluster"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-cosmosdb-databaseAccount"]: Creation complete after 2s [id=216087250389540]
turbot_policy_setting.set_resource_age_policies["azure-postgresql-server"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-mysql-server"]: Creation complete after 2s [id=216087250389541]
turbot_policy_setting.set_resource_age_policies["azure-aks-managedCluster"]: Creation complete after 2s [id=216087250332184]
turbot_policy_setting.set_resource_age_policies["azure-cosmosdb-sqlContainer"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-cosmosdb-mongoDbDatabase"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-sql-database"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-storage-container"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-databricks-databricksWorkspace"]: Creating...
turbot_policy_setting.set_resource_active_policies["azure-cosmosdb-sqlDatabase"]: Creating...
turbot_policy_setting.set_resource_age_policies["azure-compute-virtualMachine"]: Creation complete after 2s [id=216087251140146]
turbot_policy_setting.set_resource_age_policies["azure-synapseanalytics-synapseWorkspace"]: Creation complete after 2s [id=216087251183159]
turbot_policy_setting.set_resource_active_policies["azure-aks-managedCluster"]: Creation complete after 3s [id=216087252844120]
turbot_policy_setting.set_resource_age_policies["azure-postgresql-server"]: Creation complete after 3s [id=216087252786755]
turbot_policy_setting.set_resource_active_policies["azure-cosmosdb-sqlDatabase"]: Creation complete after 3s [id=216087252845148]
turbot_policy_setting.set_resource_age_policies["azure-cosmosdb-mongoDbDatabase"]: Creation complete after 3s [id=216087252843094]
turbot_policy_setting.set_resource_age_policies["azure-databricks-databricksWorkspace"]: Creation complete after 3s [id=216087252797004]
turbot_policy_setting.set_resource_age_policies["azure-cosmosdb-sqlContainer"]: Creation complete after 3s [id=216087252793926]
turbot_policy_setting.set_resource_age_policies["azure-storage-container"]: Creation complete after 3s [id=216087252793927]
turbot_policy_setting.set_resource_age_policies["azure-sql-database"]: Creation complete after 3s [id=216087252837971]

Apply complete! Resources: 41 added, 0 changed, 0 destroyed.

Outputs:

resource_active = {
  "azure-aks-managedCluster" = "Check: Active"
  "azure-compute-image" = "Check: Active"
  "azure-compute-snapshot" = "Check: Active"
  "azure-compute-virtualMachine" = "Check: Active"
  "azure-cosmosdb-databaseAccount" = "Check: Active"
  "azure-cosmosdb-mongoDbDatabase" = "Check: Active"
  "azure-cosmosdb-sqlContainer" = "Check: Active"
  "azure-cosmosdb-sqlDatabase" = "Check: Active"
  "azure-databricks-databricksWorkspace" = "Check: Active"
  "azure-mysql-server" = "Check: Active"
  "azure-postgresql-database" = "Check: Active"
  "azure-postgresql-server" = "Check: Active"
  "azure-sql-database" = "Check: Active"
  "azure-sql-server" = "Check: Active"
  "azure-storage-container" = "Check: Active"
  "azure-storage-fileShare" = "Check: Active"
  "azure-storage-storageAccount" = "Check: Active"
  "azure-synapseanalytics-synapseWorkspace" = "Check: Active"
}
smart_folder_description = Defines sets of policies for Azure check regions baseline
smart_folder_name = Azure Check Cost Control Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher
krishna@turbotindias-MacBook-Pro azure_check_cost_controls % 
